// (function(window, I18n){
// 'use strict';

// I18n.translations = I18n.translations || {};

// I18n.translations.ru = {
//     enter: 'Вход=',
//     enter_help: 'Введите имя пользователя и пароль своей учетной записи.',
//     enter_comment: 'Чтобы пользоваться сервисом необходимо авторизоваться в системе.',
//     enter_comment2: 'Для создания новой учетной записи придумайте имя пользователя и пароль, учетная запись будет создана автоматически.',
//     user_name: 'Имя пользователя',
//     user_password: 'Пароль',
//     enter_cmd: 'Войти'
//   };

// // window.console.log('i18n.ru init', I18n);
// })(this, I18n);


angular.module('i18n.ru', ['pascalprecht.translate'])
.config(['$translateProvider', function ($translateProvider) {

    // Simply register translation table as object hash
    $translateProvider.translations('ru_RU', {
        "translate": "Ошибка описания",
        "error_msg": "Ууууупс. Что-то произошло. Попробуйте перейти по одной из следующих ссылок:",

        // Login page
        "enter": "Вход",
        "enter_help": "Введите имя пользователя и пароль своей учетной записи.",
        "enter_comment": "Чтобы пользоваться сервисом необходимо авторизоваться в системе.",
        "enter_comment2": "Для создания новой учетной записи придумайте имя пользователя и пароль, учетная запись будет создана автоматически.",
        "user_name": "Имя пользователя",
        "user_password": "Пароль",
        "enter_cmd": "Войти",
        "register_cmd": "Зарегестритоваться",
        "enter_as": "Вы вошли как {{ value }}",
        "Display name": "Отображаемое имя",
        "Register date": "Дата регистрации",
        "Administrator": "Администратор",
        "Observed systems": "Наблюдаемых систем",
        "for_recovery": "Для восстановления пароля",
        "error_auth": "Ошибка авторизации, перепроверьте данные.",

        "Login": 'Вход',
        "Map": 'Карта',
        "Logs": "События",
        "Reports": "Отчеты",
        "Export GPS": "Экспорт GPS",
        "Config": "Настройки",
        "Help": "Помощь",
        "User": "Пользователь",
        'MainActions': 'Основные действия',
        'AdditionalActions': 'Дополнительные действия',
        'Logout': 'Выйти из Вашей учетной записи',
        'JoinedGroups': 'Состоит в группах',
        'ConfigureTitle': 'Настроить',
        'Language': 'Язык',

        //Registration
        'RegisterNew': 'Регистрация нового пользователя',
        'UsernamePlaceholder': 'Используется для входа',
        'PasswordPlaceholder': 'Рекомендуется не менее 6-ти символов',
        'DisplayedName': 'Отображаемое имя',
        'DisplayedNamePlaceholder': 'Так вас будут видеть другие пользователи',
        'Email': 'Электронный адрес',
        'EmailPlaceholder': 'Укажите, если хотите иметь возможность восстановления пароля',
        'GroupInfo': 'Чтобы иметь возможность создавать общие списки транспортных средств, объекты на карте, шаблоны отчетов и многое другое, необходимо создать группу пользователей (компанию) или присоединиться к существующей группе.',
        'CreateGroup': 'Создать группу',
        'CreateGroupInfo': 'Будет создана группа пользователей {{groupname }}, и вы станете ее администратором. Для приглашения пользователей в группу, сообщите им название группы и проверочное слово {{grouppassword }}.',
        'JoinGroup': 'Присоединиться к группе',
        'JoinGroupInfo': 'Чтобы присоединиться к существующей группе вы должны правильно указать название группы и проверочное слово.',
        'Group': 'Группа',
        'GroupPlaceholder': 'Используется для объединения группы пользователей',
        'CheckWord': 'Проверочное слово',
        'CheckWordPlaceholder': 'Необходимо для вступления в группу пользователей',
        'CreateUser': 'Создать пользователя',
        'UserAlreadyExists': 'Пользователь с именем {{username }} уже существует.',
        'GroupAlreadyExists': 'Группа с именем {{groupname}} уже существует.',
        'GroupNotExists': 'Группа с именем {{groupname}} не существует.',
        'WrongCheckWord': 'Проверочное слово для группы {{groupname}} не верно.',
        'SuccessRegister': 'Регистрация пользователя {{username }} прошла успешно. Теперь вы можете закрыть текущую вкладку и вернуться на вкладку входа. Или закрыть окно и зарегистрировать еще одного пользователя.',
        'SuccessRegisterTitle': 'Регистрация успешна',
        'RegisterMore': 'Зарегистрировать еще одного пользователя',
        'CloseWindow': 'Закрыть окно.',

        // Карта
        "Display Settings": "Настройки отображения",
        "Hide track": "Скрыть трек",
        "Show track": "Показать трек",
        "points_in_track": "Точек в треке: {{value}}",

        // Панель настроек карты
        'AUTO_BOUND_TRACK': 'Автоматически центровать трек',
        'ANIMATION_DIR': 'Анимация направления движения',
        'STOP_NUMBERS': 'Нумерация остановок / стоянок',

        // Страница настроек
        'add_system': 'Добавить трекер',
        'SystemsList': 'Список систем',
        'Deleting': 'Удаление',
        'DeletingWoutConfTitle': 'Удалить систему из списка наблюдения (без подтверждения)',
        'DeletingTitle': 'Удаление систем',
        'SettingsTitle': 'Нажмите, чтобы настроить трекер',
        'DisableObservation': 'Отключить наблюдение за системой',
        'PhoneNumberTitle': 'Номер телефона',

        // Страница params
        'contenteditableTitle': 'Для изменения описания поместите курсор в поле',
        'TrackerInfo': 'Информация о трекере',
        'Model': 'Модель',
        'SIMNumber': 'Номер SIM-карты',
        'RegistrationDate': 'Заергистрирован',
        'Version': 'Версия ПО',
        'Undefined': 'Не определен',
        'CopyTitle': "Для копирования в буффер обмена нажмите правую кнопку и выберите 'Копировать'",
        'StateInfo': 'Сведения о состоянии',
        'LastConection': 'Выход на связь',
        'CurrentState': 'Текущее состояние',
        'SatellitesCount': 'Количество спутников',
        'GSMLevel': 'Уровень сигнала GSM',
        'GPSLevel': 'Уровень сигнала GPS',
        'MainPower': 'Основное питание',
        'BackupPower': 'Резервное питание',
        'Coordinates': 'Координаты',
        'MarkerDate': 'Дата метки',
        'Altitude': 'Высота над уровнем моря',
        'Temperature': 'Температура',
        'Body': 'Корпус',
        'Input': 'Вход',
        'Output': 'Выход',
        'FuelLevel': 'Уровень топлива',
        'Events': 'События',
        'ExportGPS': 'Экспорт GPS',

        'LitersShort': 'л',
        'MetersShort': 'м',
        'VoltsShort': 'в',
        'KMPerHour': 'км/ч',

        'EventsTitle': 'Нажмите чтобы посмотреть события трекера',
        'ExportGPSTitle': 'Нажмите чтобы посмотреть подробности GPS',
        'VehicleInfo': 'Информация о транспортном средстве',
        'Icon': 'Значок',
        'VehicleName': 'Наименование ТС',
        'LicensePlate': 'Гос номер',
        'Year': 'Год выпуска',
        'EngineNumber': 'Номер двигателя',
        'BodyNumber': 'Номер кузова',
        'Insurance': 'Номер страхового полиса',
        'FuelConsuption': 'Расход топлива',
        'ParamsProgramming': 'Программирование параметров системы',
        'Name': 'Имя',
        'Description': 'Описание',
        'Value': 'Значение',
        'Default': 'Заводское',
        'ChangeTo': 'Изменить на',
        'CancelTitle': 'Отменить',
        'CancelChanges': 'Undo changes',
        'UnsavedTryLater': 'Трекер еще не сохранил конфигурацию. Попробуйте позже или отправьте на номер карточки трекера SMS:',
        'ChooseIcon': 'Выберите иконку для',
        'CloseBtn': 'Закрыть',

        //params descs
        'AccelerometerSensitivity': 'Чувствительность акселерометра, mg (20-200)',
        'MinimumAngle': 'Минимально-регистрируемый угол поворота (градусы) INT 5 5',
        'GPSEconomyMain': 'Выключение GPS для экономии основного питания при стоянке объекта, мин',
        'GPSEconomyBackup': 'Выключение GPS для экономии резервного питания при стоянке объекта, мин',
        'ForcedRegMov': 'Период принудительной регистрации координат при движении объекта, сек',
        'RegStopMain': 'Период регистрации координат при остановке объекта / основное питание, сек',
        'RegStopBackup': 'Период регистрации координат при остановке объекта / резервное питание, сек',
        'RegParkMain': 'Период регистрации координат при стоянке объекта / основное питание, сек',
        'RegParkBackup': 'Период регистрации координат при стоянке объекта / резервное питание, сек',
        'InputConfiguration': 'Конфигурация входа',
        'Output1State': 'Состояние выхода 1: 0-выключен / 1-включен (активный уровень - низкий)',
        'Output2State': 'Состояние выхода 2: 0-выключен / 1-включен (активный уровень - низкий)',
        'TurnedOff': 'Выключен',
        'AlarmBtn': 'Тревожная кнопка',
        'Loop': 'Шлейф',
        'Ignition': 'Зажигание',
        'FuelSensor': 'Датчик топлива',
        'MovementRegSpeed': 'Скорость, выше которой регистрируется начало движения × 0,01852 км/ч',
        'StopRegSpeed': 'Скорость, ниже которой регистрируется остановка объекта × 0,01852 км/ч',
        'FlushMove': 'Период отправки данных на сервер при движении, сек',
        'FlushStop': 'Период отправки данных на сервер при стоянке, сек',

        //params/fuel
        'FuelSensorSettings': 'Настройки датчика топлива.',
        'FuelVolume': 'Объем топлива (л)',
        'Voltage': 'Напряжение (в)',
        'DeleteBtn': 'Удалить',
        'SaveBtn': 'Сохранить',
        'AddRowBtn': 'Добавить строку',
        'DragChangeOrderTitle': 'Нажмите и тяните чтобы изменить порядок отображения объектов',

        //addtracker directive
        'Add': 'Добавить',
        'AddAllTitle': 'Добавить все трекеры компании',

        //fileload directive
        'FromFile': 'Из файла...',

        //navtool directive
        'Back': 'Назад',
        'Settings': 'Настройки',

        // report
        'Generate report': 'Сгенерировать отчет'
    });
}]);
